Revit 2025 API
ConceptualConstructionWallType Enumeration
 ConceptualConstructionType values for Walls.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConceptualConstructionWallType
Public Enumeration ConceptualConstructionWallType
public enum class ConceptualConstructionWallType
type ConceptualConstructionWallType
Members
Member name | Value | Description
LightweightConstructionHighInsulation | 0 |  Lightweight Construction High Insulation Wall
LightweightConstructionTypicalColdClimateInsulation | 1 |  Lightweight Construction Typical Cold Climate Insulation Wall
LightweightConstructionTypicalMildClimateInsulation | 2 |  Lightweight Construction Typical Mild Climate Insulation Wall
LightweightConstructionLowInsulation | 3 |  Lightweight Construction Low Insulation Wall
LightweightConstructionNoInsulationInterior | 4 |  Lightweight Construction No Insulation Interior Wall
HighMassConstructionHighInsulation | 5 |  High Mass Construction High Insulation Wall
HighMassConstructionTypicalColdClimateInsulation | 6 |  High Mass Construction Typical Cold Climate Insulation Wall
HighMassConstructionTypicalMildClimateInsulation | 7 |  High Mass Construction Typical Mild Climate Insulation Wall
HighMassConstructionNoInsulationInterior | 8 |  High Mass Construction No Insulation Interior Wall
NumWallTypeConstruction | 9 |  Total Number of Wall Type Constructions
InvalidExteriorWallTypeConstruction | -1 |  Invalid value/not set Roof Type Construction value
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace